# Curated from SigmaHQ at commit 03412947a2d6
# Source: https://github.com/SigmaHQ/sigma/blob/03412947a2d653ca1398db62a51d2de9da96b361/rules/windows/network_connection/net_connection_win_certutil_initiated_connection.yml
# License: MIT (per SigmaHQ root LICENSE).
# This rule is intel2sigma example content — original Sigma authorship preserved below.
#
title: Uncommon Network Connection Initiated By Certutil.EXE
id: 0dba975d-a193-4ed1-a067-424df57570d1
status: test
description: |
    Detects a network connection initiated by the certutil.exe utility.
    Attackers can abuse the utility in order to download malware or additional payloads.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
author: frack113, Florian Roth (Nextron Systems)
date: 2022-09-02
modified: 2024-05-31
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image|endswith: '\certutil.exe'
        Initiated: 'true'
        DestinationPort:
            - 80
            - 135
            - 443
            - 445
    condition: selection
falsepositives:
    - Unknown
level: high
